{
  "_name_or_path": "checkpoints/small-dense-decay",
  "align_long_axis": false,
  "architectures": [
    "PromptNougatModel"
  ],
  "decoder_layer": 4,
  "embed_dim": 128,
  "encoder_layer": [
    2,
    2,
    14,
    2
  ],
  "hidden_dimension": 1024,
  "input_size": [
    896,
    672
  ],
  "max_length": 4096,
  "max_position_embeddings": 4096,
  "model_type": "locr",
  "num_heads": [
    4,
    8,
    16,
    32
  ],
  "patch_size": 4,
  "torch_dtype": "float32",
  "transformers_version": "4.33.1",
  "window_size": 7
}
